# Data Cleaning and Preparation

## Data Transformation

### Removing Duplicates

In [52]:
import pandas as pd
import numpy as np

In [3]:
# let create our dataframe
data = pd.DataFrame({'key1':['one','two']*3 + ['two'],
                     'key2':[1,1,2,3,3,4,4]})

In [4]:
data

  key1  key2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
5  two     4
6  two     4

In [6]:
# let use dulicated data 
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [7]:
data.drop_duplicates()

  key1  key2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
5  two     4

In [9]:
# adding new axe
data['v1']=range(7)
data

  key1  key2  v1
0  one     1   0
1  two     1   1
2  one     2   2
3  two     3   3
4  one     3   4
5  two     4   5
6  two     4   6

In [10]:
# drop duplicate values with special columns
data.drop_duplicates(['key1'])

  key1  key2  v1
0  one     1   0
1  two     1   1

In [ ]:
data.drop_duplicates(['k1', 'k2'], keep='last')

In [45]:
# Tranforming data using a function or mapping
data = pd.DataFrame({'Regions':['Casablanca','Souss','Tadla',
                               'Rabat','Gharb','Fès',
                               'Laâyoune','Tanger','Oriental'],
                               'Prefectures-and-Provinces':[4,9,3,4,3,4,3,7,7]})
data

      Regions  Prefectures-and-Provinces
0  Casablanca                          4
1       Souss                          9
2       Tadla                          3
3       Rabat                          4
4       Gharb                          3
5         Fès                          4
6    Laâyoune                          3
7      Tanger                          7
8    Oriental                          7

In [40]:
# adding column indicat the postions
Urban_Communes = {
'Casablanca':10,
'Souss':26,
'Tadla':9,
'Rabat':13,
'Gharb':11,
'Fès':12,
'Laâyoune':4,
'Tanger':11,
'Oriental':27

}

In [46]:
# return the  restult with lower o upper case
lower = data['Regions'].str.lower()
upper = data['Regions'].str.upper()
print(lower)
print('*'*45)
print(upper)

0    casablanca
1         souss
2         tadla
3         rabat
4         gharb
5           fès
6      laâyoune
7        tanger
8      oriental
Name: Regions, dtype: object
*********************************************
0    CASABLANCA
1         SOUSS
2         TADLA
3         RABAT
4         GHARB
5           FÈS
6      LAÂYOUNE
7        TANGER
8      ORIENTAL
Name: Regions, dtype: object

In [48]:
# adding a column base on feature

data['%_prefectures'] = data['Prefectures-and-Provinces']/sum(data['Prefectures-and-Provinces'])

In [49]:
data

      Regions  Prefectures-and-Provinces  %_prefectures
0  Casablanca                          4       0.090909
1       Souss                          9       0.204545
2       Tadla                          3       0.068182
3       Rabat                          4       0.090909
4       Gharb                          3       0.068182
5         Fès                          4       0.090909
6    Laâyoune                          3       0.068182
7      Tanger                          7       0.159091
8    Oriental                          7       0.159091

In [54]:
# replace values
data = pd.Series([1.,-32,5.,-32.,3.,20.,-32,-100.,-100.,50])
data

0      1.0
1    -32.0
2      5.0
3    -32.0
4      3.0
5     20.0
6    -32.0
7   -100.0
8   -100.0
9     50.0
dtype: float64

In [55]:
data.replace(-32.,np.nan)

0      1.0
1      NaN
2      5.0
3      NaN
4      3.0
5     20.0
6      NaN
7   -100.0
8   -100.0
9     50.0
dtype: float64

In [57]:
data.replace([-32.,-100],[np.nan,0])

0     1.0
1     NaN
2     5.0
3     NaN
4     3.0
5    20.0
6     NaN
7     0.0
8     0.0
9    50.0
dtype: float64

In [58]:
# we can aslo use dict
data.replace({-32.:np.nan,-100.:0})

0     1.0
1     NaN
2     5.0
3     NaN
4     3.0
5    20.0
6     NaN
7     0.0
8     0.0
9    50.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                       index=['Ohio', 'Colorado', 'New York'],
                         columns=['one', 'two', 'three', 'four'])

In [60]:
transform = lambda x:x[:4].upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.rename(index=str.title,columns=str.lower)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
data.rename({'Ohio':'Texas'},inplace=True)